# 人物属性
ATTRIBUTE = ['力量', '体质', '敏捷', '智力', '感知', '魅力']

# 人物检查技能
CHECK_CONFIG = ['运动', '体操', '巧手', '隐匿', '奥秘', '历史', '调查', '自然', '宗教', '驯兽', '洞悉', '医药', '察觉', '求生', '欺瞒', '威吓', '表演',
                '游说']

# 人物检查技能关联
CHECK_REF = {'运动': '力量', '体操': '敏捷', '巧手': '敏捷', '隐匿': '敏捷', '奥秘': '智力', '历史': '智力', '调查': '智力', '自然': '智力', '宗教': '智力',
             '驯兽': '感知', '洞悉': '感知', '医药': '感知', '察觉': '感知', '求生': '感知', '欺瞒': '魅力', '威吓': '魅力', '表演': '魅力', '游说': '魅力'}

# 语言
LANGUAGE = ['通用语', '矮人语', '精灵语', '巨人语', '侏儒语', '地精语', '半身人语', '兽人语', '深渊语', '天界语', '龙语', '深度交流', '地狱语', '原生语', '木族语',
            '地底通用语', '贼话', '德鲁伊语']
