# 种族列表
RACE = ['侏儒', '提夫林', '人类', '龙裔', '精灵', '半兽人', '半身人', '半精灵', '矮人']
# 种族详细设定
RACE_DESCRIBE = {
    '侏儒': {'speed': 25, 'language': ['通用语', '侏儒语'], 'attr': {'智力': 2}, 'ex_skill': ['黑暗视觉', '侏儒狡黠'],
           'ex_race': {'林侏儒': {'attr': {'敏捷': 1}, 'ex_skill': ['天生幻术师', '动物沟通']},
                       '岩侏儒': {'attr': {'体质': 1}, 'ex_skill': ['工匠知识', '修补匠', '发条玩具', '打火机', '音乐盒']}}},
    '提夫林': {'speed': 30, 'language': ['通用语', '地狱语'], 'attr': {'智力': 1, '魅力': 2},
            'ex_skill': ['黑暗视觉', '地狱抗力', '地狱遗赠']},
    '人类': {'speed': 30, 'language': ['通用语'], 'attr': {'力量': 1, '体质': 1, '敏捷': 1, '智力': 1, '感知': 1, '魅力': 1},
           'ex_skill': ['额外语言']},
    '龙裔': {'speed': 30, 'language': ['通用语', '龙语'], 'attr': {'力量': 2, '魅力': 1},
           'ex_skill': ['龙族血统', '喷吐武器', '伤害抵抗']},
    '精灵': {'speed': 30, 'language': ['通用语', '精灵语'], 'attr': {'敏捷': 2},
           'ex_skill': ['黑暗视觉', '敏锐感知', '妖精先祖', '出神'], 'ex_race': {
            '高等精灵': {'attr': {'智力': 1}, 'skilled_weapon': ['长剑', '短剑', '短弓', '长弓'], 'ex_skill': ['戏法', '额外语言']},
            '木精灵': {'attr': {'感知': 1}, 'ex_skill': ['轻捷步伐', '野性面具']},
            '黑暗精灵': {'attr': {'魅力': 1}, 'skilled_weapon': ['细剑', '短剑', '手弩'], 'ex_skill': ['高等黑暗视觉', '日光敏感', '卓尔魔法']},
            '爱拉德琳': {'attr': {'智力': 1}, 'skilled_weapon': ['长剑', '短剑', '短弓', '长弓'], 'ex_skill': ['妖精步']}}},
    '半兽人': {'speed': 30, 'language': ['通用语', '兽人语'], 'attr': {'力量': 2, '体质': 1},
            'ex_skill': ['黑暗视觉', '凶恶', '残暴耐性', '野蛮攻击']},
    '半身人': {'speed': 25, 'language': ['通用语', '半身人语'], 'attr': {'敏捷': 2},
            'ex_skill': ['幸运', '勇敢', '半身人灵巧'], 'ex_race': {'轻足半身人': {'attr': {'魅力': 1}, 'ex_skill': ['天生善匿']},
                                                           '强魄半身人': {'attr': {'体质': 1}, 'ex_skill': ['强魄壮体']}}},
    '半精灵': {'speed': 30, 'language': ['通用语', '精灵语'], 'attr': {'魅力': 2, 'random': 2},
            'ex_skill': ['妖精先祖', '黑暗视觉', '多才多艺', '额外语言']},
    '矮人': {'speed': 25, 'language': ['通用语', '矮人语'], 'attr': {'体质': 2}, 'skilled_weapon': ['战斧', '手斧', '轻锤', '战锤'],
           'ex_skill': ['矮人刚毅', '黑暗视觉', '熟悉岩石'], 'ex_race': {'丘陵矮人': {'attr': {'感知': 1}, 'ex_skill': ['矮人耐力']},
                                                             '山地矮人': {'attr': {'力量': 2}, 'ex_skill': ['矮人的盔甲训练']}}}}


