# 职业
JOB = ['野蛮人', '吟游诗人', '牧师', '德鲁伊', '战士', '武僧', '圣武士', '游侠', '游荡者', '术士', '邪术师', '法师']
JOB_DESCRIBE = {
    '战士': {
        'hit_points': {
            'base_hp': 10,
            'alter_hp': 6,
        },
        'proficiencies': {
            'quick_help': '你可以按以下建议快速创造一名战士人物。首先，决定你是使用近战武器还是远程武器（或是灵巧武器），并据此将你最高的属性分配给力量或敏捷。把你次高的属性分配给体质，或是智力（如果你选择奥法骑士范型的话）。然后，选择士兵为背景。',
            'exemption': ['力量', '体质'],
            'skilled_weapon': ['简易武器', '军用武器'],
            'skilled_armor': ['全部护甲', '盾牌'],
            'skilled_tool': None,
            'skilled_item': ['杂技', '驯兽', '运动', '历史', '洞悉', '威吓', '察觉', '求生'],
            'base_skill_count': 2
        },
        'equipment': {
            '1a': ['链甲'],
            '1b': ['皮甲', '长弓', '箭(20)'],
            '2a': ['军用武器', '盾牌'],
            '2b': ['军用武器(2)'],
            '3a': ['轻弩', '弩矢(20)'],
            '3b': ['手斧(2)'],
            '4a': ['地城探险家套装'],
            '4b': ['探索者套装']
        },
        'performance': {
            '1': ['战斗风格', '回气'],
            '2': ['动作如潮(1)'],
            '3': ['武术范型?'],
            '4': ['属性值提升'],
            '5': ['额外攻击'],
            '6': ['属性值提升'],
            '7': ['范型特性*'],
            '8': ['属性值提升'],
            '9': ['不屈'],
            '10': ['范型特性*'],
            '11': ['额外攻击'],
            '12': ['属性值提升'],
            '13': ['不屈'],
            '14': ['属性值提升'],
            '15': ['范型特性*'],
            '16': ['属性值提升'],
            '17': ['动作如潮', '不屈'],
            '18': ['范型特性*'],
            '19': ['属性值提升'],
            '20': ['额外攻击']
        }
    },
    '野蛮人': {
        'hit_points': {
            'base_hp': 10,
            'alter_hp': 7
        },
        'proficiencies': {
            'quick_help': '你可以按以下建议快速创造一名野蛮人人物。首先，将你最高的属性分配给力量，次高的分配给体质。然后，选择化外之民为背景。',
            'exemption': ['力量', '体质'],
            'skilled_weapon': ['简易武器', '军用武器'],
            'skilled_armor': ['轻甲', '中甲', '盾牌'],
            'skilled_tool': None,
            'skilled_item': ['驯养动物', '运动', '威吓', '自然', '洞察', '生存'],
            'base_skill_count': 2
        },
        'equipment': {
            '1a': ['巨斧'],
            '1b': ['任意1军用近战武器'],
            '2a': ['手斧(2)'],
            '2b': ['任意1简易武器'],
            '3a': ['探索者套装'],
            '3b': ['标枪(4)']
        },
        'performance': {
            '1': ['狂暴，无甲防御'],
            '2': ['鲁莽攻击', '险境感知'],
            '3': ['原初道途?'],
            '4': ['属性值提升'],
            '5': ['额外攻击', '快速移动'],
            '6': ['道途能力*'],
            '7': ['野性直觉'],
            '8': ['属性值提升'],
            '9': ['凶蛮重击'],
            '10': ['道途能力*'],
            '11': ['无情狂暴'],
            '12': ['属性值提升'],
            '13': ['凶蛮重击'],
            '14': ['道途能力*'],
            '15': ['持久狂暴'],
            '16': ['属性值提升'],
            '17': ['凶蛮重击'],
            '18': ['不屈勇武'],
            '19': ['属性值提升'],
            '20': ['原初勇士']
        }
    },
    '吟游诗人': {
        'hit_points': {
            'base_hp': 8,
            'alter_hp': 5
        },
        'proficiencies': {
            'quick_help': '你可以直接采用下列建议来创建吟游诗人。首先，将魅力调整为你的最高属性，其次是敏捷，选择艺人背景。第三，选择舞光术和恶言相加作为已知戏法，选择魅惑人类、侦测魔法、治愈真言、雷鸣波四个１环法术。',
            'exemption': ['敏捷', '魅力'],
            'skilled_weapon': ['简易武器', '手弩', '长剑', '细剑', '短剑'],
            'skilled_armor': ['轻甲'],
            'skilled_tool': '自选三种乐器',
            'skilled_item': ['所有技能'],
            'base_skill_count': 3
        },
        'equipment': {
            '1a': ['细剑'],
            '1b': ['长剑'],
            '1c': ['任意1简易武器'],
            '2a': ['大使套装'],
            '2b': ['演员套装'],
            '3a': ['鲁特琴'],
            '3b': ['除鲁特琴外任意1乐器'],
            '4a': ['皮甲', '匕首']
        },
        'performance': {
            '1': ['施法', '吟游激励（d6）'],
            '2': ['多才多艺', '休憩曲（d6）'],
            '3': ['吟游诗人学院?', '专精'],
            '4': ['属性值提升'],
            '5': ['吟游激励（d8）', '激励源泉'],
            '6': ['反迷惑', '吟游诗人学院能力*'],
            '7': None,
            '8': ['属性值提升'],
            '9': ['休憩曲（d8）'],
            '10': ['吟游激励（d10）', '专精', '魔法奥秘'],
            '11': None,
            '12': ['属性值提升'],
            '13': ['休憩曲（d10）'],
            '14': ['魔法奥秘', '吟游诗人学院能力'],
            '15': ['吟游激励（d12）'],
            '16': ['属性值提升'],
            '17': ['休憩曲（d12）'],
            '18': ['魔法奥秘'],
            '19': ['属性值提升'],
            '20': ['激励燃魂']
        }
    },
    '牧师': {
        'hit_points': {
            'base_hp': 8,
            'alter_hp': 5
        },
        'proficiencies': {
            'quick_help': '你可以使用以下建议快速创造一个牧师。首先，感知是你的最高属性，其次是力量或者体质，然后选择侍祭作为你的背景。',
            'exemption': ['感知', '魅力'],
            'skilled_weapon': ['简易武器', '手弩', '长剑', '细剑', '短剑'],
            'skilled_armor': ['轻甲', '中甲', '盾牌'],
            'skilled_tool': None,
            'skilled_item': ['历史', '洞察', '医疗', '劝服', '宗教'],
            'base_skill_count': 2
        },
        'equipment': {
            '1a': ['硬头槌'],
            '1b': ['战锤（若你熟练该武器）'],
            '2a': ['鳞甲'],
            '2b': ['皮甲'],
            '2c': ['链甲（若你熟练该护甲）'],
            '3a': ['轻型十字弓', '弓矢(20)'],
            '3b': ['任意1简单武器'],
            '4a': ['祭司套装', '探索者套装'],
            '4b': ['神父包', '匕首'],
            '5a': ['盾牌', '圣徽']
        },
        'performance': {
            '1': ['施法能力', '领域*'],
            '2': ['引导神力（1/休息）', '领域能力*'],
            '3': None,
            '4': ['属性值提升'],
            '5': ['摧毁亡灵（cr1/2）'],
            '6': ['引导神力（2/休息）', '领域能力*'],
            '7': None,
            '8': ['属性值提升', '摧毁亡灵（cr１）', '领域能力*'],
            '9': None,
            '10': ['神力干预'],
            '11': ['摧毁亡灵（cr2）'],
            '12': ['属性值提升'],
            '13': None,
            '14': ['摧毁亡灵（cr3）'],
            '15': None,
            '16': ['属性值提升'],
            '17': ['摧毁不死⽣物（cr4）', '领域特性*'],
            '18': ['引导神力（3/休息）'],
            '19': ['属性值提升'],
            '20': ['进阶神力干预']
        }
    },
    '德鲁伊': {
        'hit_points': {
            'base_hp': 8,
            'alter_hp': 5
        },
        'notice': '德鲁伊不能穿或使用金属制的护甲和盾',
        'proficiencies': {
            'quick_help': '你可以利用以下建议快速创建一个德鲁伊。首先感知是你的最高属性。接着是体质。第二选择隐士（hermit）背景。',
            'exemption': ['感知', '智力'],
            'skilled_weapon': ['木棒', '匕首', '飞镖', '标枪', '硬头锤', '木棍', '弯刀', '镰刀', '投石索', '矛'],
            'skilled_armor': ['轻甲', '中甲', '盾牌'],
            'skilled_tool': '药草师工具',
            'skilled_item': ['神秘知识', '驯养动物', '洞悉', '医疗', '自然知识', '察觉', '宗教知识', '生存'],
            'base_skill_count': 2
        },
        'equipment': {
            '1a': ['木盾'],
            '1b': ['任意1简易武器'],
            '2a': ['弯刀'],
            '2b': ['任意1近战简易武器'],
            '3a': ['皮甲', '探索者套装', '德鲁伊法器']
        },
        'performance': {
            '1': ['德鲁伊语', '施法'],
            '2': ['荒野形态', '德鲁伊结社*'],
            '3': None,
            '4': ['荒野形态提升', '属性值提升'],
            '5': None,
            '6': ['德鲁伊结社特性*'],
            '7': None,
            '8': ['荒野形态提升', '属性值提升'],
            '9': None,
            '10': ['德鲁伊结社特性*'],
            '11': None,
            '12': ['属性值提升'],
            '13': None,
            '14': ['德鲁伊结社特性*'],
            '15': None,
            '16': ['属性值提升'],
            '17': None,
            '18': ['不老身躯', '野兽施法'],
            '19': ['属性值提升'],
            '20': ['大德鲁伊']
        }
    },
}
